[{"chaperTitle":"Day 7 #100DaysOfCodeMình thích Laravel nên hôm nay mình sẽ bắt đầu tìm hiểu về nó xem sao, do mình cài PHP 7.2, vì thế mình sẽ cài đặt Laravel 5.8. Để cài được laravel 5.8 mình cần phải đủ yêu cầu sau:Nói chung mình cũng mới tìm hiểu nên cũng không rành lắm mấy vụ hổ trợ trên lắm, chỉ biết là cài PHP >= 7.1.3, còn lại tính sau vậy gặp lỗi nào thì mò lỗi đó thôi. Còn không lỗi thì ngon lành kakaBạn có thể tìm hiểu thêm về cài đặt Laravel 5.4 tại đây: \n+ Hướng dẫn cài đặt Laravel 5.4 (phần 1)\n+ Hướng dẫn cài đặt Laravel 5.4 (phần 2)Mở CMD lên mình chạy câu lệnh dưới đây để cài laravel 5.8Sau khi tải xong mình được thư mục giống dưới đây + app : trong dự án của chúng ta phần lớn thường lưu các file như , Controller,Models,middleware, đều nằm ở trong đấy\n+ bootstrap : Chứa các tệp mà framework Laravel sử dụng để khởi động mỗi khi nó chạy.\n+ config : là nơi cấu hình tập tin, như cấu hình database, cors,session,mail,...\n+ database : là nơi chứa các file migrations,seed, factories\n+ public : thư mục này chứa file index.php để phục vụ trang website, khi máy chủ trỏ đến, đồng thời chứa các file như: images,css,js để phục vụ cho giao diện website\n+ resources : chứa thư mục (js,lang,sass,views), \n  - views: chưa các file template blade cấu hình giao diện người dùng\n  - js : là nơi chưa giao diện front-end như(vuejs,react)\n  - sass : file biên dịch css \n  - lang : chứa các file biên dịch ngôn ngữ\n+ routes : dùng cấu hình bộ định tuyến cho các Route, thiết lập route website, restfull API, xác thực Broadcast\n+ storage : nơi lưu trữ , caches, logs và các tệp hệ thống đã biên dịch\n+ tests : dùng để test unit\n+ vendor : chứa toàn bộ mã nguồn của laravel\n+ .editorconfig : Cung cấp hướng dẫn trình soạn thảo văn bản/IDE của bạn về các standar mã hóa của Laravel (ví dụ: kích thước của thụt lề, charset, và  cắt khoảng trắng dấu). Bạn sẽ thấy điều này trong bất kỳ ứng dụng Laravel nào chạy 5.5 trở lên.\n+ .env and .env.example : các biến môi trường (các biến được sẽ khác nhau trong mỗi phiên bản laravel) \n+ .gitignore and .gitattributes : Tệp cấu hình Git.\n+ artisan : Cho phép bạn chạy các lệnh Artisan\n+ composer.json and composer.lock : Tập tin cấu hình cho Composer; composer.json là người dùng có thể chỉnh sửa và composer.lock thì không phải. Những tệp này chia sẻ một số thông tin cơ bản về dự án và cũng xác định phụ thuộc PHP của nó.\n+ package.json : cũng giống như composer.json, nhưng ở đây file package.json chứa thông tin các lệnh script để chạy NPM và devDependencies xây dựng hệ thống\n+ phpunit.xml : nó là một tập tin cấu hình cho PHPUnit dùng để test unit\n+ server.php : cấu hình trỏ tới thư mục public để hiển thị ứng dụng website, cần phải chạy lệnh php artisan serve\n+ webpack.mix.js : là file cấu hình webpack, giúp ta build tất cả các file css, js, css pre-prosessor như scss,sass,less,...Okay giờ tôi chạy thư mục đó bằng cách http://localhost/laravel58/public sẽ được giao diện như dưới đâyCác bạn thấy đó, để chạy mình cần phải trỏ tới thư mục public, giờ mình không thích, mình muốn bỏ public đi, chỉ sử dụng đường dẫn như thế này http://localhost/laravel58 \nOkay, mình tạo file .htaccess trong thư mục laravel58giờ mình chạy thử lại đường dẫn http://localhost/laravel58 thì nó đã okOkay giờ mình mới mò trong project laravel này , mình sẽ sửa lại giao diện nó hiện thị khác xíu theo ý mình\n+ Vào thư mục laravel58/resources/views, mở file welcome.blade.php và chỉnh sửa lại như sau:Để cho file đó được gọi lên, laravel đã cấu hình bộ route trong thư mục laravel58/routes, mình thấy nó có các file sao\n+ api.php : cấu hình route cho api, chẳng hạn như dùng trong restful API\n+ web.php : cấu hình route cho web, chẳng hạn các route cho front-end\n+ channels.php : dành cho mục đích broadcasting, chẳng hạn cấu hình route cho ứng dụng nhận thông báo chat\n+ console.php : dành cho việc đăng kí artisan commandOkay, chỉ mới tìm hiểu nên chẳng biết dùng sao, từ từ nghiên cứu vậy, giờ ta hãy mở file web.php trong thư mục routes","chaperData":[{"postTitle":"","linkPath":"https://100daysofcode.hoanguyenit.com/create-project-laravel-58-using-composer.html","filename":"create-project-laravel5_8-using-composer.jpg"},{"postTitle":"","linkPath":"https://100daysofcode.hoanguyenit.com/create-project-laravel-58-using-composer.html","filename":"create-project-laravel5_8-using-composer-01.jpg"},{"postTitle":"","linkPath":"https://100daysofcode.hoanguyenit.com/create-project-laravel-58-using-composer.html","filename":"create-project-laravel5_8-using-composer-02.jpg"},{"postTitle":"","linkPath":"https://100daysofcode.hoanguyenit.com/create-project-laravel-58-using-composer.html","filename":"create-project-laravel5_8-using-composer-03.jpg"}]}]